# Parameter Type Id View Position Name Property

Source: https://www.revitapidocs.com/2026/1f21c3a1-9c69-41d0-0041-f90e7314f6dc.htm

---

| Parameter Type Id View Position Name Property |
| --- |

"Name"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId ViewPositionName { get; }
```

```
Public Shared ReadOnly Property ViewPositionName As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ ViewPositionName {
	ForgeTypeId^ get ();
}
```

```
static member ViewPositionName : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace